# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X1

# 5
# 1 2 3 4 5
# 6
# -> 5

n = int(input('Введите количество эелементов массива: '))
list1 = [int(input()) for i in range(n)]
x = int(input('Введите элемент поиска: '))
for i in range(len(list1)):
    if x-n[i]
        print(n[i])
    else:
        i += 1


