# Задача 2: Найдите сумму цифр трехзначного числа
# 123 -> 6 (1 + 2 + 3)

a = (input('Введите трехзначное число: '))
x1 = int(a[0])
x2 = int(a[1])
x3 = int(a[2])
print(f'Сумма всех цифр трезначного числа равнва: {x1+x2+x3}')
